Repository: cs50/lib50
Catalog: lib50/locale/*/LC_MESSAGES/lib50.po
Languages: id, vi

source: No files were submitted.
id: Tidak ada file yang dikirimkan.
vi: Không có tập tin nào để nộp.

source: {} does not exist at {}/{}
id: {} tidak ada di {}/{}
vi: {} không tồn tại tại {}/{}

source: Connecting
id: Menghubungkan
vi: Đang kết nối

source: Invalid slug for {}. Did you mean something else?
id: Slug tidak valid untuk {}. Apakah maksud Anda sesuatu yang lain?
vi: Slug cho {} không hợp lệ.

source: Go to {results} to see your results.
id: Buka {results} untuk melihat hasil Anda.
vi: Vui lòng đến {results} để xem kết qủa của bạn.

source: No files in this directory are expected for submission.
id: Tidak ada file dalam direktori ini yang diharapkan untuk diserahkan.

source: Authenticating
id: Mengautentikasi
vi: Đang xác nhận

source: Preparing
id: Mempersiapkan
vi: Đang chuẩn bị

source: Looks like {} isn't enabled for your account yet.
id: Sepertinya {} belum diaktifkan untuk akun Anda.

source: Please contact your instructor about this issue.
id: Silakan hubungi instruktur Anda tentang masalah ini.

source: Please go to https://submit.cs50.io in your web browser and try again.
id: Silakan buka https://submit.cs50.io di browser web Anda dan coba lagi.

source: Uploading
id: Mengunggah
vi: Đang tải lên

source: automated commit by {}
id: commit otomatis oleh {}
vi: commit tự động bởi {}

source: Invalid slug: {}. Did you mean something else?
id: Slug tidak valid: {}. Apakah maksud Anda sesuatu yang lain?
vi: Slug này không hợp lệ: {}.

source: Invalid slug: {}. Multiple configurations (both .yaml and .yml) found.
id: Slug tidak valid: {}. Beberapa konfigurasi (.yaml dan .yml) ditemukan.
vi: Slug này không hợp lệ: {} Đã tìm thấy nhiều cấu hình (cả .yaml và .yml).

source: You don't have git. Install git, then re-run!
id: Anda tidak memiliki git. Pasang git, lalu jalankan kembali!
vi: Bạn không có git. Vui lòng cài đặt git và thử lại.

source: You have an old version of git. Install version 2.7 or later, then re-run!
id: Anda memiliki versi lama git. Pasang versi 2.7 atau yang lebih baru, kemudian jalankan kembali!
vi: Bạn đang sử dụng phiên bản git cũ. Hãy cài đặt phiên bản 2.7 trở lên, sau đó thử lại.

source: Invalid slug
id: Slug tidak valid
vi: Slug này không hợp lệ.

source: Could not connect to GitHub, it seems you are offline.
id: Tidak dapat terhubung ke GitHub, sepertinya Anda sedang offline.

source: Invalid slug: {}
id: Slug tidak valid: {}
vi: Slug này không hợp lệ: {}

source: Invalid slug. Did you mean {}, without the leading and trailing slashes?
id: Slug tidak valid. Apakah maksud Anda {}, tanpa garis miring awal dan akhir?
vi: Slug này không hợp lệ. Ý bạn là {}, không có dấu gạch chéo ở đầu và cuối phải không?

source: Invalid slug. Did you mean {}, without the leading slash?
id: Slug tidak valid. Apakah maksud Anda {}, tanpa garis miring awal?
vi: Slug này không hợp lệ. Ý bạn là {}, không có dấu gạch chéo ở đầu phải không?

source: Invalid slug. Did you mean {}, without the trailing slash?
id: Slug tidak valid. Apakah maksud Anda {}, tanpa garis miring akhir?
vi: Slug này không hợp lệ. Ý bạn là {}, không có dấu gạch chéo ở cuối phải không?

source: Invalid slug. Did you mean to submit something else?
id: Slug tidak valid. Apakah Anda bermaksud mengirimkan sesuatu yang lain?
vi: Slug này không hợp lệ. Bạn có ý định nộp bài khác không?

source: Could not connect to GitHub. Do make sure you are connected to the internet.
id: Tidak dapat terhubung ke GitHub. Pastikan Anda terhubung ke internet.
vi: Không kết nối với GitHub được. Hãy đảm bảo bạn đã kết nối với internet.

source: Could not connect to GitHub. It looks like GitHub is having some issues with {}. Do check on https://www.githubstatus.com and try again later.
id: Tidak dapat terhubung ke GitHub. Sepertinya GitHub mengalami beberapa masalah dengan {}. Periksa https://www.githubstatus.com dan coba lagi nanti.
vi: Không kết nối với GitHub được. GitHub có vẻ bị vấn đề về {}.Vui lòng kiểm tra tại https://www.githubstatus.com và thử lại sau.

source: These files are too large to be submitted: {} Remove these files from your directory and then re-run!
id: File-file ini terlalu besar untuk dikirim: {} Hapus file-file ini dari direktori Anda dan kemudian jalankan kembali!
vi: Những tập tin này quá lớn để nộp: {} Hãy xóa những tập tin này khỏi thư mục, rồi thử lại.

source: These files are too large to be submitted: {} Install git-lfs (or remove these files from your directory) and then re-run!
id: File-file ini terlalu besar untuk dikirim: {} Pasang git-lfs (atau hapus file-file ini dari direktori Anda) dan kemudian jalankan kembali!
vi: Những tập tin này quá lớn để nộp: {} Vui lòng cài đặt git-lfs (hay xoá những tập tin này khỏi thư mục), rồi thử lại.

source: GitHub username:
id: Nama pengguna GitHub:

source: GitHub password:
id: Kata sandi GitHub:

source: Looks like you have two-factor authentication enabled! Please generate a personal access token (with GitHub's `repo` scope) and use it as your password. See https://help.github.com/articles/creating-a-personal-access-token-for-the-command-line for more info.
id: Sepertinya Anda mengaktifkan otentikasi dua faktor! Silakan buat token akses pribadi dan menggunakannya sebagai password Anda. Lihat https://help.github.com/articles/creating-a-personal-access-token-for-the-command-line untuk info lebih lanjut.

source: Invalid username and/or password.
id: Nama pengguna dan/atau kata sandi tidak valid.

source: Could not authenticate user.
id: Tidak dapat mengautentikasi pengguna.

source: Username cannot be empty, please try again.
id: Nama pengguna tidak boleh kosong, silakan coba lagi.

source: Invalid UTF-8 character(s) in password
id: Karakter UTF-8 invalid dalam kata sandi

source: Password cannot be empty, please try again.
id: Kata sandi tidak boleh kosong, silakan coba lagi.

source: You seem to be missing these required files:
id: Tampaknya Anda kehilangan file-file ini:
vi: Bạn thiếu những tập tin bắt buộc này:

source: You are currently in: {}, did you perhaps intend another directory?
id: Anda sedang dalam: {}, apakah mungkin maksud Anda direktori lain?
vi: Bạn đang ở: {}, có lẽ bạn muốn chuyển đến thư mục khác phải không?

source: Two config files (.cs50.yaml and .cs50.yml) found at {}
id: Dua file konfigurasi (.cs50.yaml dan .cs50.yml) ditemukan di {}
vi: Hai tập tin cấu hình (.cs50.yaml và .cs50.yml) được tìm thấy tại {}

source: No config file (.cs50.yaml or .cs50.yml) found at {}
id: Tidak ada file konfigurasi (.cs50.yaml atau .cs50.yml) ditemukan di {}
vi: Không tìm thấy tập tin cấu hình (.cs50.yaml hoặc .cs50.yml) tại {}

source: Config is not valid yaml.
id: Konfigurasi bukan yaml yang valid.
vi: Cấu hình yaml không hợp lệ.

source: {} is not enabled by this config file.
id: {} tidak diaktifkan oleh file konfigurasi ini.

source: {} is not a valid tag for {}
id: {} bukan tag yang valid untuk {}
vi: {} không phải là tag hợp lệ cho {}

source: Cannot include/exclude paths outside the current directory, but such a path ({}) was specified.
vi: Không thể bao gồm/loại trừ các đường dẫn bên ngoài thư mục này, nhưng đường dẫn ({}) đã được chỉ định.

source: No files in this directory are expected by {}.
vi: Thư mục này không có tập tin nào {} đang mong đợi.

source: Verifying
vi: Đang thảm tra

source: Make sure your username and/or personal access token are valid and {} is enabled for your account. To enable {},
vi: Hãy đảm bảo username và/hoặc mã truy cập cá nhân của bạn hợp lệ và {} đã được bật cho tài khoản của bạn. Để bật {},

source: please contact your instructor.
vi: vui lòng liên hệ với giáo viên.

source: please go to {} in your web browser and try again.
vi: vui lòng đến {} và thử lại.

source: Looks like you are in a directory with too many (> {}) files.
vi: Bạn đang ở trong một thư mục có quá nhiều tập tin (> {}).

source: Enter username for GitHub:
vi: Nhập username cho GitHub:

source: Enter personal access token for GitHub:
vi: Nhập mã truy cập cá nhân cho GitHub:

source: You might be using your GitHub password to log in, but that's no longer possible. But you can still use check50 and submit50! See https://cs50.readthedocs.io/github for instructions.
vi: Bạn có thể đang sử dụng mật khẩu GitHub để đăng nhập, nhưng phương pháp này không còn khả thi nữa.Tuy nhiên, bạn vẫn có thể sử dụng check50 và submit50. Xem https://cs50.readthedocs.io/github để biết hướng dẫn.
